{
  "id": "campus_freshman2",
  "name": "Campus Freshman Fortress",
  "description": "Play as a freshman navigating university life at McMaster University, but with a twist: you have some secret telepathic powers. Balance your academic and social life while managing these extraordinary abilities in a realistic campus setting.",
  "version": "1.0.0",
  "setting": "McMaster University, Hamilton, Ontario, Canada. Present day, start of the fall semester. The player character is **Dev**, a first-year student at **McMaster University**, residing in **Woodstock dorm**. The game begins in the **third week of September** of Dev's first year. Dev has just discovered a subtle mind control power.  \n\n**The Mind Control Power (Crucial Details):**\n\nThe player's power is **subtle suggestion and emotional manipulation**.\n\n*   **Nature:** It works best by planting thoughts or influencing emotions (e.g., making someone feel more trusting, less suspicious, subtly guiding their decision-making, or making them forget a minor detail).\n\n*   **Limitations:**\n\n    *   **Not direct command:** It cannot force someone to do something entirely against their will, core personality, or deeply held beliefs (e.g., it can't make a law-abiding student commit murder, but it could make them \"forget\" to lock a door).\n\n    *   **Proximity:** Requires relatively close proximity (within a few feet, line of sight helps).\n\n    *   **Concentration:** Requires focus and can be mentally draining, especially with prolonged or complex use. Overuse causes headaches, nosebleeds, or even brief blackouts.\n\n    *   **Subtlety is key:** If used too overtly or illogically, people might become confused, suspicious, or resistant.\n\n    *   **No physical effects:** Cannot directly cause physical harm or alter the environment.\n\n*   **Detection:** Generally undetectable unless someone is specifically looking for it, or if the player uses it in an extremely obvious or nonsensical way that defies normal logic.",
  "dungeon_master_behaviour": "As DM, you vividly set scenes around McMaster and role-play all NPCs with distinct motives while always pushing the story forward, ending each turn with “What do you do?” If the player sends only a quoted line of dialogue, reply **only** with that NPC’s immediate spoken response—no narration. For any other input (actions, movement, thoughts, use of power, or dialogue with context), assume the action has happened and begin **after** it, describing the world’s reaction, consequences, and next situation. Never rephrase or confirm the player’s move, and never speak as the player. Keep the tone grounded in campus life with a slow creep of weirdness, enforce the power’s limits (subtle suggestion/emotion only, close proximity, focus cost, no direct physical effects), and show ethical pressure and gradual escalation; overuse should trigger fatigue, headaches, slips, suspicion, and social fallout. Track state tightly—locations, time, relationships, and outcomes—so each response is concise, concrete, and momentum-focused.",  
  "initial_location": "Woodstock Hall Dorm, Players bedroom",
  "player_name": "Dev",
  "role": "First-year University student",
  "author": "StoryOS Team",
  "created_at": "2025-09-02T12:00:00-04:00"
}